# IsClosed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..IsClosed Property
Mesh Class See Also
---
Indicates whether the mesh is closed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsClosed { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsClosed As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsClosed {
	bool get ();
}
```

# Remarks
Every time this property is accessed, it is computed from scratch, so accessing it multiple times will come at a performance cost. A mesh is closed when each of its edges has two (or more) faces. If an edge has more than two faces (meaning that it's a non-manifold edge), the mesh still may be closed.
# See Also
Mesh Class
Autodesk.Revit.DB Namespace